console.log(
    `Привет проверяющий!Я очень старался сделать это задание и прошу,  пожалуйста, прочесть этот текст-самооценку перед твоей самостоятельной проверкой: \r\n 
    1. Вёрстка, дизайн, UI всех трёх страниц приложения: +60 (Выполнено,добавил интересный дизайн,адаптивность функционирует) \r\n
    2. Аудиоплеер +30 (Выполнено, внедрен стандартный плеер, функционал такой-же как в демо , добавлен регулятор громкости) \r\n
    3. Верхняя панель страницы викторины: +20 (Выполнено Правильное отображение счета игры, текущий вопрос выделяется стилем ) \r\n
    4. Блок с вопросом: +20(Выполнено) \r\n 
    5. Блок с вариантами ответов: +60 (Выполнено все согласно подпунктов требований и исправно работает)\r\n
    6. Блок с описанием: +30 (Убрал время проигрывания и длительность трека т.к. это демо плеер и в требованиях к заданию не указывалось их обязательное наличие в вспомогательном плеере)\r\n
    7. Кнопка перехода к следующему вопросу: +30 (Выполнено)\r\n 
    8. Extra scope : +15 (Сделал галерею со слайдером + Добавил Pre-loader для людей с слабым интернет-соединением)\r\n 

    Итог: Хотелось бы получить за эту работу 265-270 баллов, и очень сильно прошу не снижать оценку ведь я очень долго и усердно трудился над этим заданием.\r\n
    Большое спасибо за проверку ребята.
    `)